[
    {
        "index": 1,
        "month": "January",
        "day": "1",
        "year": "2025",
        "image": "/images/new-years-day.jpg",
        "title": "New Year's Day",
        "description": "New Year's Day, celebrated on January 1st, marks the beginning of a new calendar year. It is a globally recognized holiday that symbolizes a fresh start, the opportunity for renewal, and a time for reflection. People celebrate with a variety of traditions including fireworks displays, family gatherings, and festive meals. Many cultures also incorporate rituals for setting personal goals and resolutions for the coming year. In the Philippines, families gather for a 'media noche' feast, celebrating the start of the year with their loved ones.",
        "holidayType": "Regular Holiday"
    },
    {
        "index": 2,
        "month": "January",
        "day": "23",
        "year": "2025",
        "image": "/images/first-philippine-republic-day.jpg",
        "title": "First Philippine Republic Day",
        "description": "The First Philippine Republic Day, celebrated on January 23, commemorates the establishment of the First Philippine Republic in 1899, following the Philippine Revolution against Spanish colonial rule. This day honors the courageous efforts of Filipino leaders, including Emilio Aguinaldo, who declared the country’s independence from Spain. The holiday serves as a reminder of the Filipino people's resilience and their pursuit of sovereignty. Events typically include historical re-enactments and ceremonies that highlight the significance of this milestone in the nation's history.",
        "holidayType": "Special (Working) Holiday"
    },
    {
        "index": 3,
        "month": "January",
        "day": "27",
        "year": "2025",
        "image": "/images//images/lailatul-isra-wal-mi-raj.jpg",
        "title": "Lailatul Isra Wal Mi Raj",
        "description": "Lailatul Isra Wal Mi Raj is one of the most significant events in Islam, celebrated by Muslims around the world. It commemorates the night journey (Isra) and ascension (Miraj) of the Prophet Muhammad, where he is believed to have traveled from Mecca to Jerusalem and then ascended to the heavens. The event holds deep spiritual significance, emphasizing the Prophet's spiritual elevation and the importance of prayer in the Islamic faith. The night is marked with prayers, reflection, and acts of charity as a means to honor this divine event.",
        "holidayType": "Religious Holiday"
    },
    {
        "index": 4,
        "month": "January",
        "day": "29",
        "year": "2025",
        "image": "/images/lunar-new-year.jpg",
        "title": "Lunar New Year's Day",
        "description": "Lunar New Year, which falls on January 29th in 2025, is celebrated by millions of people across Asia and beyond. It marks the first day of the lunar calendar and is one of the most important cultural events in many countries, including China, Korea, and Vietnam. The celebration is filled with customs and traditions such as family reunions, giving red envelopes with money for luck, and enjoying a variety of traditional foods. In the Philippines, the holiday is observed with lion dances, fireworks, and prayers for prosperity and good fortune.",
        "holidayType": "Special (Non-Working) Holiday"
    },
    {
        "index": 5,
        "month": "February",
        "day": "14",
        "year": "2025",
        "image": "/images/valentines-day.png",
        "title": "Valentine's Day",
        "description": "Valentine's Day, celebrated on February 14th, is an annual celebration of love and affection between intimate partners. The origins of the holiday are rooted in the ancient Roman festival of Lupercalia, but it is now widely recognized as a day to express love through cards, gifts, and flowers. In many countries, including the Philippines, people exchange heartfelt messages, go out on romantic dates, and give flowers, particularly red roses, as symbols of love. It’s also a day to celebrate friendship and kindness, as people often take the opportunity to show appreciation to friends and family as well.",
        "holidayType": "Special Observance"
    },
    {
        "index": 6,
        "month": "February",
        "day": "25",
        "year": "2025",
        "image": "/images/edsa-people-power-revolution-anniversary.jpg",
        "title": "EDSA People Power Revolution Anniversary",
        "description": "The EDSA People Power Revolution Anniversary, observed on February 25th, commemorates the peaceful uprising in 1986 that ended the 21-year dictatorship of Ferdinand Marcos and restored democracy in the Philippines. This day is a national reflection on the importance of democracy, freedom, and non-violent protest. The event is remembered with ceremonies, public gatherings, and historical re-enactments. It serves as a reminder of the Filipino people's unity and their collective power to bring about change without violence, making it a cornerstone of Philippine history.",
        "holidayType": "Special Observance"
    },
    {
        "index": 7,
        "month": "March",
        "day": "1",
        "year": "2025",
        "image": "/images/ramadan-start.png",
        "title": "Ramadan Start",
        "description": "Ramadan is the ninth month of the Islamic lunar calendar, observed by Muslims worldwide as a month of fasting, prayer, charity, and reflection. The start of Ramadan, which begins on March 1st in 2025, marks a time of spiritual growth as Muslims fast from dawn until sunset, refraining from food, drink, and other physical needs. The holiday emphasizes self-discipline, empathy for the less fortunate, and a closer connection to God. The conclusion of Ramadan is celebrated with Eidul-Fitr, a day of feasting and thanksgiving.",
        "holidayType": "Religious Holiday"
    },
    {
        "index": 8,
        "month": "March",
        "day": "20",
        "year": "2025",
        "image": "/images/march-equinox.jpg",
        "title": "March Equinox",
        "description": "The March Equinox, occurring on March 20th, marks the official beginning of spring in the Northern Hemisphere. On this day, day and night are nearly equal in length, which symbolizes balance and harmony. In many cultures, the equinox is celebrated as a time for renewal, growth, and the reawakening of nature after the cold winter months. It is also a day when people take time to reflect on personal growth and the balance of work, rest, and relationships in their lives.",
        "holidayType": "Season"
    },
    {
        "index": 9,
        "month": "March",
        "day": "31",
        "year": "2025",
        "image": "/images/eidul-fitar.jpg",
        "title": "Eidul-Fitar",
        "description": "Eidul-Fitar, or Eid al-Fitr, is the celebration that marks the end of the Islamic holy month of Ramadan. It is a joyous occasion celebrated with prayer services, festive meals, and the exchange of gifts. Eidul-Fitar is a time for Muslims to give thanks for the strength shown during the fast and to share their blessings with those less fortunate by giving to charity. The celebration is characterized by a sense of community and unity, as families and friends gather to celebrate this important occasion together.",
        "holidayType": "Religious Holiday"
    },
    {
        "index": 10,
        "month": "April",
        "day": "9",
        "year": "2025",
        "image": "/images/araw-ng-kagitingan.jpg",
        "title": "Araw ng Kagitingan (Fall of Bataan)",
        "description": "Araw ng Kagitingan, also known as the Fall of Bataan Day, is observed on April 9th to honor the Filipino and American soldiers who fought and made great sacrifices during the Battle of Bataan in 1942. This day serves as a solemn reminder of the courage and heroism of those who endured hardship, starvation, and death during the infamous Death March. The holiday is marked by memorial services, wreath-laying ceremonies, and educational programs to preserve the memory of those who fought for the country's freedom during World War II.",
        "holidayType": "Regular Holiday"
    },
    {
        "index": 11,
        "month": "April",
        "day": "17",
        "year": "2025",
        "image": "/images/maundy-thursday.jpg",
        "title": "Maundy Thursday",
        "description": "Maundy Thursday is a Christian observance commemorating the Last Supper of Jesus Christ with his disciples. It is the beginning of the Holy Week, leading up to Easter. On this day, Jesus instituted the sacrament of Holy Communion by sharing bread and wine with his apostles. In the Philippines, Maundy Thursday is part of the religious observance of Holy Week, with many attending mass, re-enacting the Washing of the Feet, and engaging in penance. It is a day for reflecting on Christ's humility and sacrifice. Filipinos also practice 'Pabasa,' where religious hymns are sung in a continuous manner, telling the story of Christ's passion. This day is a time of spiritual reflection, prayer, and renewal of faith.",
        "holidayType": "Religious Holiday"
    },
    {
        "index": 12,
        "month": "April",
        "day": "18",
        "year": "2025",
        "image": "/images/good-friday.png",
        "title": "Good Friday",
        "description": "Good Friday is one of the most solemn days in the Christian calendar, commemorating the crucifixion of Jesus Christ. It is observed on the Friday before Easter and marks the day when Jesus was sentenced to death by crucifixion, ultimately sacrificing His life for the salvation of humanity. Christians around the world remember this day with solemn services, prayer, and fasting. In the Philippines, Good Friday is a day for reflection on Christ's passion and sacrifice, and many Catholics attend church services, participate in processions, and meditate on the sufferings of Christ. The day is marked by quiet reverence, with many Filipinos engaging in personal acts of devotion, fasting, and penance.",
        "holidayType": "Religious Holiday"
    },
    {
        "index": 13,
        "month": "April",
        "day": "19",
        "year": "2025",
        "image": "/images/black-saturday.jpg",
        "title": "Black Saturday",
        "description": "Black Saturday, also called Holy Saturday, is the day after Good Friday, marking the period of mourning before the resurrection of Jesus on Easter Sunday. It is a day of quiet reflection, prayer, and waiting, as Christians observe the final hours of Jesus's death. Filipinos take part in the traditional 'Visita Iglesia,' where they visit seven different churches to pray and meditate. While some people reflect on the suffering and death of Jesus Christ, others engage in quiet family activities, maintaining the solemn atmosphere of the Holy Week. The day is a time for contemplation on the themes of death, sacrifice, and hope for the resurrection to come on Easter Sunday.",
        "holidayType": "Special (Non-Working) Holiday"
    },
    {
        "index": 14,
        "month": "April",
        "day": "20",
        "year": "2025",
        "image": "/images/easter-sunday.jpg",
        "title": "Easter Sunday",
        "description": "Easter Sunday celebrates the resurrection of Jesus Christ from the dead, a central tenet of Christian faith. It is a joyous occasion that marks the end of the Lenten season and the beginning of the Easter season. In the Philippines, Easter Sunday is celebrated with church services, including the 'Salubong' or the dawn procession, where the Virgin Mary is reunited with the risen Christ. Families gather to enjoy meals together, often with festive foods and desserts. The holiday also symbolizes hope, renewal, and the triumph of life over death. Many Filipino families participate in Easter egg hunts, a fun and symbolic way to celebrate the arrival of new life in spring.",
        "holidayType": "Religious Holiday"
    },
    {
        "index": 15,
        "month": "May",
        "day": "1",
        "year": "2025",
        "image": "/images/labor-day.png",
        "title": "Labor Day",
        "description": "Labor Day, observed on May 1st, honors the achievements and contributions of workers around the world. It originated in the United States in the late 19th century as a movement to recognize the rights of laborers and improve working conditions. In the Philippines, Labor Day is a public holiday, marked by parades, rallies, and demonstrations advocating for workers’ rights. Many labor unions and worker organizations gather to push for better wages, job security, and labor laws. In addition to its political significance, Labor Day is also a time for workers to relax and enjoy the fruits of their labor, with many families taking time off to bond, picnic, and celebrate together.",
        "holidayType": "Regular Holiday"
    },
    {
        "index": 16,
        "month": "June",
        "day": "7",
        "year": "2025",
        "image": "/images/eid-al-adha.jpg",
        "title": "Eid al-Adha (Feast of the Sacrifice)",
        "description": "Eid al-Adha, also known as the Feast of the Sacrifice, is one of the two most significant Islamic holidays. It commemorates the willingness of Ibrahim (Abraham) to sacrifice his son as an act of obedience to God. In remembrance of Ibrahim’s devotion, Muslims around the world sacrifice an animal, typically a goat, cow, or sheep, and share the meat with the less fortunate. In the Philippines, Muslims gather for prayers at mosques or open fields, and the holiday is a time for charity, feasting, and spending time with family. The holiday underscores the values of faith, charity, sacrifice, and obedience to God. Eid al-Adha also marks the end of the Hajj pilgrimage to Mecca, one of the Five Pillars of Islam.",
        "holidayType": "Religious Holiday"
    },
    {
        "index": 17,
        "month": "June",
        "day": "8",
        "year": "2025",
        "image": "/images/eid-al-adha.jpg",
        "title": "Eid al-Adha Day 2",
        "description": "Eid al-Adha Day 2 continues the celebrations of Eid, where the sacrifice of animals is completed, and the distribution of meat to the poor is performed. In addition to the communal prayers, the holiday emphasizes generosity, charity, and strengthening ties with family and community. In the Philippines, this day is a special holiday where Muslim communities organize social gatherings, share meals, and engage in charitable works. It is a time of giving and celebrating the unity of the Ummah (Muslim community). Families often exchange gifts, and the holiday also serves as an opportunity to reflect on the values of humility and submission to God.",
        "holidayType": "Special (Non-Working) Holiday"
    },
    {
        "index": 18,
        "month": "June",
        "day": "12",
        "year": "2025",
        "image": "/images/independence-day.jpg",
        "title": "Independence Day",
        "description": "Independence Day is a national holiday in the Philippines, celebrated on June 12th to commemorate the declaration of independence from Spanish colonial rule in 1898. On this day, Emilio Aguinaldo, the leader of the Philippine revolution, raised the Philippine flag in Kawit, Cavite, signaling the birth of the independent Filipino nation. In the Philippines, Independence Day is marked by flag-raising ceremonies, military parades, patriotic speeches, and cultural performances. It is a day of national pride, where Filipinos celebrate their freedom, sovereignty, and the sacrifices made by national heroes like José Rizal and Andres Bonifacio. It is also a time to reflect on the country's journey toward democracy and independence.",
        "holidayType": "National Holiday"
    },
    {
        "index": 19,
        "month": "June",
        "day": "15",
        "year": "2025",
        "image": "/images/fathers-day.jpg",
        "title": "Father's Day",
        "description": "Father's Day is celebrated on the third Sunday of June to honor fathers, grandfathers, and father figures for their contributions to family and society. It is a day to express gratitude for their love, guidance, and support. In the Philippines, families celebrate Father’s Day by giving gifts, writing heartfelt messages, and enjoying meals together. It is a time to recognize the hard work and sacrifices that fathers make to ensure the well-being of their families. Many Filipinos also take this day to acknowledge father figures in their communities who have provided guidance and care, regardless of biological ties. Father’s Day celebrates fatherhood in all its forms and serves as a reminder of the important role fathers play in shaping the future of their children.",
        "holidayType": "Special Observance"
    },
    {
        "index": 20,
        "month": "June",
        "day": "21",
        "year": "2025",
        "image": "/images/june-solstice.jpg",
        "title": "June Solstice",
        "description": "The June Solstice, occurring on June 21st, marks the longest day and shortest night of the year in the Northern Hemisphere. It is a day when the sun reaches its highest point in the sky, signaling the peak of summer. The solstice has been observed by cultures throughout history, often celebrated with festivals and rituals honoring the sun. In the Philippines, the June solstice is not officially recognized as a public holiday, but it holds cultural significance in various indigenous communities. For some, the solstice is a time of harvest celebrations, while others reflect on the cycles of nature and the importance of balance. The solstice symbolizes growth, renewal, and the life-giving energy of the sun.",
        "holidayType": "Season"
    },
    {
        "index": 21,
        "month": "August",
        "day": "21",
        "year": "2025",
        "image": "/images/ninoy-aquino-day.jpg",
        "title": "Ninoy Aquino Day",
        "description": "Ninoy Aquino Day, observed on August 21st, commemorates the assassination of former Senator Benigno 'Ninoy' Aquino Jr., a key figure in the Philippines' struggle against the Marcos dictatorship. Aquino's death sparked a wave of political unrest that eventually led to the People Power Revolution in 1986, resulting in the downfall of President Ferdinand Marcos. On this day, Filipinos reflect on Aquino's sacrifice for democracy and the enduring legacy of his fight for political freedom and human rights. The day is marked by ceremonies, speeches, and tributes to Aquino’s courage and determination. It serves as a reminder of the importance of democratic ideals and the power of collective action in shaping the nation's future.",
        "holidayType": "Special (Non-Working) Holiday"
    },
    {
        "index": 22,
        "month": "August",
        "day": "25",
        "year": "2025",
        "image": "/images/national-heroes-day.jpg",
        "title": "National Heroes Day",
        "description": "National Heroes Day, observed on the last Monday of August, honors the lives and sacrifices of the country's national heroes who fought for freedom and independence from colonial rule. The holiday commemorates the courage of Filipino revolutionaries such as José Rizal, Andres Bonifacio, and Emilio Aguinaldo, who played pivotal roles in the struggle against the Spanish and later the American colonization. On this day, Filipinos gather for ceremonies at monuments and landmarks dedicated to these heroes, and schools and institutions hold educational activities to teach about the importance of national pride and patriotism. National Heroes Day is a time to reflect on the sacrifices that have shaped the nation’s identity and its ongoing quest for liberty and justice.",
        "holidayType": "Regular Holiday"
    },
    {
        "index": 23,
        "month": "September",
        "day": "3",
        "year": "2025",
        "image": "/images/yamashita-surrender-day.jpg",
        "title": "Yamashita Surrender Day",
        "description": "Yamashita Surrender Day, observed on September 3rd, marks the day when General Tomoyuki Yamashita, the commanding officer of the Japanese Imperial Army in the Philippines, officially surrendered to the Allied forces at the end of World War II. This event effectively ended the Japanese occupation of the Philippines, a period marked by significant hardships and atrocities. The surrender took place in the northern part of Luzon, and the day is often remembered as a symbol of the Filipino people's resilience during the war. In addition to commemorative services, Yamashita Surrender Day serves as a reminder of the sacrifices made during the war and the importance of peace and reconciliation. The holiday emphasizes remembrance for those who lost their lives in the conflict and the enduring hope for peace in the region.",
        "holidayType": "Special (Working) Holiday"
    },
    {
        "index": 24,
        "month": "September",
        "day": "5",
        "year": "2025",
        "image": "/images/maulid-un-nabi.jpg",
        "title": "Maulid un-Nabi (Tentative Date)",
        "description": "Maulid un-Nabi, celebrated by Muslims worldwide, marks the birth of the Prophet Muhammad, the founder of Islam. This religious holiday is observed with prayers, readings from the Qur'an, and the sharing of meals. In the Philippines, the Muslim community commemorates the event with special prayers, feasts, and gatherings at mosques. Maulid un-Nabi serves as a time for Muslims to reflect on the teachings and life of Prophet Muhammad, emphasizing values such as kindness, generosity, justice, and the importance of following the path of righteousness. In some regions, the holiday is celebrated with parades, singing, and storytelling. It is a significant event for fostering unity and spirituality among the Muslim community.",
        "holidayType": "Religious Holiday"
    },
    {
        "index": 25,
        "month": "September",
        "day": "8",
        "year": "2025",
        "image": "/images/feast-nativity-mary.jpg",
        "title": "Feast of the Nativity of Mary",
        "description": "The Feast of the Nativity of the Blessed Virgin Mary, celebrated on September 8th, marks the birth of Mary, the mother of Jesus Christ. In Christian tradition, this day is significant as it marks the beginning of Mary's role in the salvation history of humanity. The feast day is celebrated with Masses, prayers, and hymns in Catholic churches around the world, honoring Mary's purity, obedience to God's will, and her role as the mother of the Savior. In the Philippines, the feast is observed with religious processions, the singing of hymns, and gatherings of families to reflect on the virtues of Mary as a model of faith and devotion. The celebration serves as an opportunity for believers to seek Mary's intercession and to strengthen their own spiritual life.",
        "holidayType": "Special (Working) Holiday"
    },
    {
        "index": 26,
        "month": "September",
        "day": "23",
        "year": "2025",
        "image": "/images/september-equinox.jpg",
        "title": "September Equinox",
        "description": "The September Equinox, occurring around September 23rd, marks the point when the Sun crosses the celestial equator, resulting in equal day and night durations across the globe. In many cultures, the equinox is seen as a time of balance and harmony between light and dark. While not a public holiday in the Philippines, the equinox has cultural significance among indigenous groups who associate it with agricultural practices and natural cycles. For some, the event signifies a time of harvest, a reminder of the interconnectedness between the Earth and its people. The September Equinox is also recognized as the official start of the autumn season in the Northern Hemisphere, signaling the transition from the warmth of summer to the cooler days of fall.",
        "holidayType": "Season"
    },
    {
        "index": 27,
        "month": "November",
        "day": "1",
        "year": "2025",
        "image": "/images/all-saints-day.jpg",
        "title": "All Saints' Day",
        "description": "All Saints' Day, observed on November 1st, is a Christian holiday dedicated to honoring all saints, known and unknown. The day is devoted to the remembrance of those who have led exemplary lives of holiness and faith. It is also a day to reflect on the lives of loved ones who have passed away and to celebrate their spiritual legacy. In the Philippines, All Saints' Day is a major holiday, marked by visits to cemeteries where families clean the graves of their deceased relatives, light candles, and offer prayers. The day is a solemn occasion, where families come together to honor the memories of their departed, and to reflect on the Christian ideals of hope, redemption, and eternal life.",
        "holidayType": "Special (Non-Working) Holiday"
    },
    {
        "index": 28,
        "month": "November",
        "day": "2",
        "year": "2025",
        "image": "/images/all-souls-day.jpg",
        "title": "All Souls' Day",
        "description": "All Souls' Day, observed on November 2nd, is dedicated to praying for the souls of the departed, particularly those in Purgatory. It is a time for reflection, prayer, and remembrance of the deceased. In the Philippines, All Souls' Day is often observed together with All Saints' Day, forming part of the 'Undas' holiday observance. Filipinos visit the graves of their loved ones, light candles, and offer prayers for their souls. The day is a solemn reminder of the transient nature of life and the importance of praying for those who have passed away. All Souls' Day serves as an opportunity for the living to remember their family members and friends, and to reflect on their own mortality and the hope of eternal life.",
        "holidayType": "Special Observance"
    },
    {
        "index": 29,
        "month": "November",
        "day": "30",
        "year": "2025",
        "image": "/images/bonifacio-day.jpg",
        "title": "Bonifacio Day",
        "description": "Bonifacio Day, observed on November 30th, commemorates the birth of Andrés Bonifacio, a national hero who played a central role in the Philippine Revolution against Spanish rule. Bonifacio founded the Katipunan, a revolutionary society that fought for the independence of the Philippines. This day serves as a tribute to Bonifacio's leadership, bravery, and sacrifice for the nation. In the Philippines, Bonifacio Day is observed with ceremonies, flag-raising events, and speeches honoring his contributions to the fight for freedom. It is a day of national pride, where Filipinos reflect on the value of courage, patriotism, and the importance of standing up for justice. The holiday is also a reminder of the sacrifices made by other revolutionaries who helped shape the Philippines into the sovereign nation it is today.",
        "holidayType": "Regular Holiday"
    },
    {
        "index": 30,
        "month": "December",
        "day": "8",
        "year": "2025",
        "image": "/images/feast-immaculate-conception.jpg",
        "title": "Feast of the Immaculate Conception",
        "description": "The Feast of the Immaculate Conception, celebrated on December 8th, honors the belief that the Virgin Mary was conceived without original sin. This Catholic dogma holds that Mary, from the very moment of her conception, was preserved from the stain of sin by God's grace. The feast is a day to celebrate her purity and her role as the mother of Jesus Christ. In the Philippines, the feast is widely observed with Masses, prayers, and processions, especially in areas with strong Catholic communities. It is a solemn occasion, reflecting on the virtues of Mary and her importance in the Christian faith. For many Filipinos, it is a day to reflect on the grace of God and the holiness that Mary represents.",
        "holidayType": "Special (Non-Working) Holiday"
    },
    {
        "index": 31,
        "month": "December",
        "day": "21",
        "year": "2025",
        "image": "/images/december-solstice.jpg",
        "title": "December Solstice",
        "description": "The December Solstice, occurring around December 21st, marks the shortest day and the longest night of the year in the Northern Hemisphere. This natural event signifies the transition into winter, as the tilt of the Earth's axis causes the Sun to appear at its lowest point in the sky. Although not an official public holiday in the Philippines, the solstice holds cultural and ecological significance in many indigenous communities. It is often seen as a time of renewal, a reminder of the cycles of nature and the importance of balance in life. The December Solstice is also a time for reflection and preparation for the new year, marking the natural rhythm that governs the changing seasons.",
        "holidayType": "Season"
    },
    {
        "index": 32,
        "month": "December",
        "day": "24",
        "year": "2025",
        "image": "/images/christmas-eve.jpg",
        "title": "Christmas Eve",
        "description": "Christmas Eve, observed on December 24th, is the evening before Christmas Day, a celebration of the birth of Jesus Christ. For many Filipinos, Christmas Eve is the highlight of the holiday season, as it is celebrated with Noche Buena, a grand family meal that includes traditional Filipino dishes such as lechon, hamon, and queso de bola. The night is filled with joyous celebrations, midnight Mass, and the exchange of gifts. Christmas Eve is a time to gather with loved ones, reflect on the significance of the Christmas story, and share in the spirit of giving and unity. In the Philippines, the holiday is marked by festive decorations, lights, and the singing of carols, symbolizing hope, peace, and goodwill.",
        "holidayType": "Special (Non-Working) Holiday"
    },
    {
        "index": 33,
        "month": "December",
        "day": "25",
        "year": "2025",
        "image": "/images/christmas-day.png",
        "title": "Christmas Day",
        "description": "Christmas Day, celebrated on December 25th, commemorates the birth of Jesus Christ, a central figure in Christianity. It is one of the most important and widely celebrated holidays in the Philippines. The day is filled with religious services, family gatherings, and feasts. In the Philippines, Christmas is a deeply spiritual occasion, with many attending Mass to celebrate the birth of the Savior. It is a day of joy, peace, and generosity, as people exchange gifts, visit family members, and engage in acts of charity. The celebration continues into the evening with festive meals and activities, as Filipino families come together to strengthen bonds of love and unity. Christmas Day also marks the climax of the long Christmas season in the country, which begins as early as September.",
        "holidayType": "Regular Holiday"
    },
    {
        "index": 34,
        "month": "December",
        "day": "30",
        "year": "2025",
        "image": "/images/rizal-day.jpg",
        "title": "Rizal Day",
        "description": "Rizal Day, observed on December 30th, honors the life and legacy of Dr. José Rizal, the national hero of the Philippines. Rizal was a revolutionary thinker, writer, and doctor who championed reforms and fought against the Spanish colonial rule through his writings, particularly in his famous works 'Noli Me Tangere' and 'El Filibusterismo.' His execution by the Spanish authorities in 1896 inspired the Filipinos to continue the fight for independence, leading to the Philippine Revolution. Rizal Day is observed with ceremonies, flag-raising events, and tributes to his contributions to the nation's independence and identity. Filipinos reflect on his ideals of freedom, education, and civic responsibility, celebrating his enduring impact on the nation’s history and development.",
        "holidayType": "Regular Holiday"
    },
    {
        "index": 35,
        "month": "December",
        "day": "31",
        "year": "2025",
        "image": "/images//images/new-years-eve.jpg",
        "title": "New Year's Eve",
        "description": "New Year's Eve, observed on December 31st, marks the final day of the year and is a time of celebration, reflection, and preparation for the coming year. In the Philippines, New Year’s Eve is one of the most festive occasions of the year, characterized by loud firecrackers, family reunions, and grand feasts. The holiday is rooted in traditions that signify the farewell to the old year and the welcoming of new opportunities. Filipinos participate in 'Media Noche,' a midnight meal that symbolizes prosperity and abundance in the year ahead. New Year’s Eve is also a time for making resolutions, as many people reflect on the past year and set new goals for personal growth. The festivities culminate in a spectacular display of fireworks, signifying joy, hope, and new beginnings.",
        "holidayType": "Special (Non-Working) Holiday"
    }
]
